# 데이터 합치기와 재구성
## 멀티 인덱스

In [10]:
# 모듈 불러오기
import numpy as np
import pandas as pd

In [7]:
# 학생 점수를 시리즈로 생성
# pd.Series(리스트, [인덱스])
# 멀티 인덱스 첫번째:학년 두번째: 반
s = pd.Series(
    [85,90,78,92,88,75],
               # 2차원 배열(두개의리스트)
    index=[['1학년','1학년','1학년','2학년','2학년','2학년'],
           ['a반','a반','b반','a반','b반','a반']])
s

1학년  a반    85
     a반    90
     b반    78
2학년  a반    92
     b반    88
     a반    75
dtype: int64

In [ ]:
s['1학년']
s.index
s.loc[ {'1학년', 'a반')]
s.loc[('1학년', ['a반','b반'])

### 연습문제

In [53]:
# 매출 데이터를 담은 시리즈 생성
# 데이터 : 매출
# 인덱스 : (멀티) 지역-지점
# 1단계는 지역
# 2단계는 지점

s = pd.Series([120,100,90,80],
             index = [ ['서울','서울','부산','부산'],
                       ['강남점','강북점','해운대점','서면점'] ]
             )
s

서울  강남점     120
    강북점     100
부산  해운대점     90
    서면점      80
dtype: int64

In [56]:
print(s.index)
print(s['서울'])
print(s['부산'])
s.loc[('부산','해운대점')] # 튜틀

MultiIndex([('서울',  '강남점'),
            ('서울',  '강북점'),
            ('부산', '해운대점'),
            ('부산',  '서면점')],
           )
강남점    120
강북점    100
dtype: int64
해운대점    90
서면점     80
dtype: int64

np.int64(90)

In [31]:
s = pd.Series([300,250,500,400],
              index=[['전자제품', '전자제품', '식품', '식품'],
                     ['노트북', '휴대폰', '라면', '과자']]
             )
s

전자제품  노트북    300
      휴대폰    250
식품    라면     500
      과자     400
dtype: int64

In [33]:
print(s['전자제품'].sum())
s.loc[('식품','라면')]

550

np.int64(500)

In [34]:
s = pd.Series([40,35,50,45],
              index=[['1학년', '1학년', '2학년', '2학년'],
                     ['국어','수학','국어','수학']]
             )
s

1학년  국어    40
     수학    35
2학년  국어    50
     수학    45
dtype: int64

In [29]:
s['1학년'].sum()
s.loc[('2학년','수학')]

np.int64(45)

# 데이터프레임의 멀티 인덱스

In [43]:
# Series : 한줄짜리 데이터
# DataFrame : 표 모양의 데이터

# 상품 판매 데이터를 데이터프레임으로 생성
# df = pd.DataFrame(2차원배열데이터)
# df = pd.DataFrame(데이터,[행인덱스],[컬럼])
# 데이터 : 4행 2열의 배열(판매데이터)
# 행인덱스 : 멀티(연도-지점)
# 열 컬럼 : 제품
df = pd.DataFrame([[50,60],[70,80],[100,110],[120,130]],
                 index=[['2020년','2020년','2021년','2021년'],
                       ['구월점','부평점','구월점','부평점']],
                 columns=['제품1','제품2']
                 )
df

           제품1  제품2
2020년 구월점   50   60
      부평점   70   80
2021년 구월점  100  110
      부평점  120  130

In [51]:
print(df.index)
print(df.columns)
df.loc['2020년'] # 열 생략 가능

MultiIndex([('2020년', '구월점'),
            ('2020년', '부평점'),
            ('2021년', '구월점'),
            ('2021년', '부평점')],
           )
Index(['제품1', '제품2'], dtype='object')

     제품1  제품2
구월점   50   60
부평점   70   80

In [ ]:
df.loc[('2020년','구월점')] # 튜플

In [55]:
df.loc[('2021년','부평점'), '제품2']

np.int64(130)

In [57]:
df = pd.DataFrame([[120,45],[95,60],[150,70],[110,55]],
                  index=[['중앙도서관','중앙도서관','시립도서관','시립도서관'],
                         ['1월','2월','1월','2월']],
                  columns=['소설','과학']
                 )
df

           소설  과학
중앙도서관 1월  120  45
      2월   95  60
시립도서관 1월  150  70
      2월  110  55

In [61]:
df.loc['중앙도서관']

     소설  과학
1월  120  45
2월   95  60

In [62]:
df.loc[('시립도서관','2월'),'과학']

np.int64(55)

In [64]:
df = pd.DataFrame([[320,280],[210,230],[400,390],[180,200]],
                  index=[['2022년','2022년','2023년','2023년'],
                         ['SUV','세단','SUV','세단']],
                  columns=['1분기','2분기']
                 )
df

           1분기  2분기
2022년 SUV  320  280
      세단   210  230
2023년 SUV  400  390
      세단   180  200

In [67]:
df.loc['2022년']

     1분기  2분기
SUV  320  280
세단   210  230

In [68]:
df.loc[('2023년','세단'), '2분기']

np.int64(200)

In [70]:
arrays = [
    ['서울지점', '서울지점', '부산지점', '부산지점'],
    ['7월', '8월', '7월', '8월']
]
index = pd.MultiIndex.from_arrays(arrays, names=('지점', '월'))
columns = ['싱글룸','더블룸']

data = [[45,30],[50,35],[60,40],[55,38]]
df = pd.DataFrame(data, index=index, columns=columns)
df

         싱글룸  더블룸
지점   월
서울지점 7월   45   30
     8월   50   35
부산지점 7월   60   40
     8월   55   38

In [71]:
df.loc['서울지점']

    싱글룸  더블룸
월
7월   45   30
8월   50   35

In [72]:
df.loc[('부산지점','8월'),'더블룸']

np.int64(38)

In [73]:
arrays = [
    ['가전', '가전', '식품', '식품'],
    ['노트북', '청소기', '라면', '과자']
]
index = pd.MultiIndex.from_arrays(arrays, names=('가전', '식품'))
columns = ['1월','2월']

data = [[120,140],[80,95],[200,220],[150,160]]
df = pd.DataFrame(data, index=index, columns=columns)
df

         1월   2월
가전 식품
가전 노트북  120  140
   청소기   80   95
식품 라면   200  220
   과자   150  160

In [74]:
df.loc['가전']

      1월   2월
식품
노트북  120  140
청소기   80   95

In [75]:
df.loc[('식품','라면'),'2월']

np.int64(220)